Revit 2027 API
ViewsExportedByContextEventArgs.GetViewIds Method
 Gets the views that were exported by CustomExporter.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetViewIds()
Public Function GetViewIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetViewIds()
member GetViewIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The views that were exported by CustomExporter.
See Also
Reference
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace